In [3]:
import pandas as pd

df = pd.read_csv('T_T100_MARKET_ALL_CARRIER.csv')
# df.head()
df.columns

Index(['PASSENGERS', 'FREIGHT', 'MAIL', 'DISTANCE', 'UNIQUE_CARRIER',
       'AIRLINE_ID', 'UNIQUE_CARRIER_NAME', 'UNIQUE_CARRIER_ENTITY', 'REGION',
       'CARRIER', 'CARRIER_NAME', 'CARRIER_GROUP', 'CARRIER_GROUP_NEW',
       'ORIGIN_AIRPORT_ID', 'ORIGIN_AIRPORT_SEQ_ID', 'ORIGIN_CITY_MARKET_ID',
       'ORIGIN', 'ORIGIN_CITY_NAME', 'ORIGIN_STATE_ABR', 'ORIGIN_STATE_FIPS',
       'ORIGIN_STATE_NM', 'ORIGIN_COUNTRY', 'ORIGIN_COUNTRY_NAME',
       'ORIGIN_WAC', 'DEST_AIRPORT_ID', 'DEST_AIRPORT_SEQ_ID',
       'DEST_CITY_MARKET_ID', 'DEST', 'DEST_CITY_NAME', 'DEST_STATE_ABR',
       'DEST_STATE_FIPS', 'DEST_STATE_NM', 'DEST_COUNTRY', 'DEST_COUNTRY_NAME',
       'DEST_WAC', 'YEAR', 'QUARTER', 'MONTH', 'DISTANCE_GROUP', 'CLASS',
       'DATA_SOURCE'],
      dtype='object')

In [34]:
len(df.columns)

41

In [39]:
len(df['UNIQUE_CARRIER_NAME'].unique())

318

In [71]:
df.loc[(df['ORIGIN_COUNTRY_NAME'] == 'United Kingdom') & (df['DEST_COUNTRY_NAME'] == 'United States'), ['FREIGHT', 'MAIL', 'PASSENGERS']].sum()

FREIGHT       903296879.0
MAIL           29838395.0
PASSENGERS     10685614.0
dtype: float64

In [5]:
df.groupby('UNIQUE_CARRIER_NAME').median()['DISTANCE'].sort_values(ascending=False).head()

UNIQUE_CARRIER_NAME
Singapore Airlines Ltd.        8440.0
Cathay Pacific Airways Ltd.    8020.0
South African Airways          7967.0
Longtail Aviation Ltd.         7855.5
Qantas Airways Ltd.            7853.0
Name: DISTANCE, dtype: float64

In [58]:
ten_most = df.sort_values('FREIGHT', ascending=False)[0:10]
ten_most['TOTAL'] = ten_most['FREIGHT'] + ten_most['MAIL']

ten_most[['FREIGHT', 'MAIL', 'TOTAL']]

           FREIGHT    MAIL        TOTAL
54180  105077869.0  5849.0  105083718.0
19720   61061463.0  5492.0   61066955.0
50058   44301137.0     0.0   44301137.0
1548    44252519.0     0.0   44252519.0
34949   41962565.0     0.0   41962565.0
41132   41550544.0     0.0   41550544.0
41903   40854272.0     0.0   40854272.0
14265   40446788.0     0.0   40446788.0
46749   39731643.0     0.0   39731643.0
23220   39484298.0     0.0   39484298.0

In [98]:
df.loc[df['ORIGIN_COUNTRY_NAME'] == 'United States'].sort_values('PASSENGERS', ascending=False)[['UNIQUE_CARRIER_NAME', 'PASSENGERS']]
       # , df.sort_values('PASSENGERS', ascending=False)[0:10]]

                UNIQUE_CARRIER_NAME  PASSENGERS
321387         Alaska Airlines Inc.     97644.0
321386         Delta Air Lines Inc.     97329.0
321385         Alaska Airlines Inc.     97098.0
321384         Alaska Airlines Inc.     97011.0
321383         Alaska Airlines Inc.     96984.0
...                             ...         ...
38686   Federal Express Corporation         0.0
38683   Federal Express Corporation         0.0
38681   Federal Express Corporation         0.0
38680   Federal Express Corporation         0.0
0           Miami Air International         0.0

[287115 rows x 2 columns]